scripts/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 100
  defaults:
    headers:
      Content-Type: application/json
scenarios:
  - name: Health and Booking Mix
    flow:
      - get:
          url: "/health"
      - post:
          url: "/api/passengers"
          json:
            name: "load-test-user-{{ $randomInt(1, 1000000) }}"
      - post:
          url: "/api/bookings"
          json:
            passengerId: "{{ passengerId }}"
            pickup: { lat: 28.5355, lng: 77.391 }
            dropoff: { lat: 28.6139, lng: 77.209 }
            luggageCount: 1